In [2]:
cd D:\\Arman\Dokkho Cohort 4 Course Materials\Data Analysis Project

D:\Arman\Dokkho Cohort 4 Course Materials\Data Analysis Project

In [15]:
import numpy as np
import pandas as pd

### Batsman Summary

In [16]:
df = pd.read_csv('batsman_summary.csv')
df.head()

,match,teamInnings,battingPos,batsmanName,runs,balls,4s,6s,SR,out/not_out,match_id
0,Namibia Vs Sri Lanka,Namibia,1,Michael van Lingen,3,6,0,0,50,out,T20I # 1823
1,Namibia Vs Sri Lanka,Namibia,2,Divan la Cock,9,9,1,0,100,out,T20I # 1823
2,Namibia Vs Sri Lanka,Namibia,3,Jan Nicol Loftie-Eaton,20,12,1,2,166.66,out,T20I # 1823
3,Namibia Vs Sri Lanka,Namibia,4,Stephan Baard,26,24,2,0,108.33,out,T20I # 1823
4,Namibia Vs Sri Lanka,Namibia,5,Gerhard Erasmus(c),20,24,0,0,83.33,out,T20I # 1823

In [17]:
columns_to_drop = ['match','battingPos','out/not_out','match_id']
df.drop(columns=columns_to_drop,inplace=True)

In [18]:
df.head()

  teamInnings             batsmanName  runs  balls  4s  6s      SR
0     Namibia      Michael van Lingen     3      6   0   0      50
1     Namibia           Divan la Cock     9      9   1   0     100
2     Namibia  Jan Nicol Loftie-Eaton    20     12   1   2  166.66
3     Namibia           Stephan Baard    26     24   2   0  108.33
4     Namibia      Gerhard Erasmus(c)    20     24   0   0   83.33

In [19]:
new_column_names={'teamInnings':'Country','batsmanName':'Batsman','runs':'Runs','balls':'Balls','SR':'Strike_Rates'}
df.rename(columns=new_column_names,inplace=True)

In [20]:
df.head()

   Country                 Batsman  Runs  Balls  4s  6s Strike_Rates
0  Namibia      Michael van Lingen     3      6   0   0           50
1  Namibia           Divan la Cock     9      9   1   0          100
2  Namibia  Jan Nicol Loftie-Eaton    20     12   1   2       166.66
3  Namibia           Stephan Baard    26     24   2   0       108.33
4  Namibia      Gerhard Erasmus(c)    20     24   0   0        83.33

In [21]:
df.tail()

     Country           Batsman  Runs  Balls  4s  6s Strike_Rates
694  England         Phil Salt    10      9   2   0       111.11
695  England        Ben Stokes    52     49   5   1       106.12
696  England       Harry Brook    20     23   1   0        86.95
697  England         Moeen Ali    19     13   3   0       146.15
698  England  Liam Livingstone     1      1   0   0          100

In [22]:
df.isnull().sum()

Country         0
Batsman         0
Runs            0
Balls           0
4s              0
6s              0
Strike_Rates    0
dtype: int64

In [23]:
df.shape

(699, 7)

In [25]:
columns = df.columns.tolist()
new_columns = columns[1:] + [columns[0]]
df = df[new_columns]

In [26]:
df.head()

                  Batsman  Runs  Balls  4s  6s Strike_Rates  Country
0      Michael van Lingen     3      6   0   0           50  Namibia
1           Divan la Cock     9      9   1   0          100  Namibia
2  Jan Nicol Loftie-Eaton    20     12   1   2       166.66  Namibia
3           Stephan Baard    26     24   2   0       108.33  Namibia
4      Gerhard Erasmus(c)    20     24   0   0        83.33  Namibia

In [27]:
df.tail()

              Batsman  Runs  Balls  4s  6s Strike_Rates  Country
694         Phil Salt    10      9   2   0       111.11  England
695        Ben Stokes    52     49   5   1       106.12  England
696       Harry Brook    20     23   1   0        86.95  England
697         Moeen Ali    19     13   3   0       146.15  England
698  Liam Livingstone     1      1   0   0          100  England

In [28]:
df.to_csv('new_batsman_summary.csv',index=False)

### Bowler Summary

In [29]:
df1 = pd.read_csv('bowler_summary.csv')
df1.head()

,match,bowlingTeam,bowlerName,overs,maiden,runs,wickets,economy,0s,4s,6s,wides,noBalls,match_id
0,Namibia Vs Sri Lanka,Sri Lanka,Maheesh Theekshana,4.0,0,23,1,5.75,7,0,0,2,0,T20I # 1823
1,Namibia Vs Sri Lanka,Sri Lanka,Dushmantha Chameera,4.0,0,39,1,9.75,6,3,1,2,0,T20I # 1823
2,Namibia Vs Sri Lanka,Sri Lanka,Pramod Madushan,4.0,0,37,2,9.25,6,3,1,0,0,T20I # 1823
3,Namibia Vs Sri Lanka,Sri Lanka,Chamika Karunaratne,4.0,0,36,1,9.00,7,3,1,1,0,T20I # 1823
4,Namibia Vs Sri Lanka,Sri Lanka,Wanindu Hasaranga de Silva,4.0,0,27,1,6.75,8,1,1,0,0,T20I # 1823

In [30]:
columns_drop = ['match','wides','noBalls','match_id']
df1.drop(columns=columns_drop,inplace=True)
df1.head()

,bowlingTeam,bowlerName,overs,maiden,runs,wickets,economy,0s,4s,6s
0,Sri Lanka,Maheesh Theekshana,4.0,0,23,1,5.75,7,0,0
1,Sri Lanka,Dushmantha Chameera,4.0,0,39,1,9.75,6,3,1
2,Sri Lanka,Pramod Madushan,4.0,0,37,2,9.25,6,3,1
3,Sri Lanka,Chamika Karunaratne,4.0,0,36,1,9.00,7,3,1
4,Sri Lanka,Wanindu Hasaranga de Silva,4.0,0,27,1,6.75,8,1,1

In [31]:
new_columns_name = {'bowlingTeam':'Country','bowlerName':'Bowler','overs':'Overs','maiden':'Maiden','runs':'Runs','wickets':'Wickets','economy':'Economy'}
df1.rename(columns=new_columns_name,inplace=True)
df1.head()

,Country,Bowler,Overs,Maiden,Runs,Wickets,Economy,0s,4s,6s
0,Sri Lanka,Maheesh Theekshana,4.0,0,23,1,5.75,7,0,0
1,Sri Lanka,Dushmantha Chameera,4.0,0,39,1,9.75,6,3,1
2,Sri Lanka,Pramod Madushan,4.0,0,37,2,9.25,6,3,1
3,Sri Lanka,Chamika Karunaratne,4.0,0,36,1,9.00,7,3,1
4,Sri Lanka,Wanindu Hasaranga de Silva,4.0,0,27,1,6.75,8,1,1

In [32]:
columns1 = df1.columns.tolist()
new_column1 = columns1[1:] + [columns1[0]]
df1 = df1[new_column1]
df1.head()

,Bowler,Overs,Maiden,Runs,Wickets,Economy,0s,4s,6s,Country
0,Maheesh Theekshana,4.0,0,23,1,5.75,7,0,0,Sri Lanka
1,Dushmantha Chameera,4.0,0,39,1,9.75,6,3,1,Sri Lanka
2,Pramod Madushan,4.0,0,37,2,9.25,6,3,1,Sri Lanka
3,Chamika Karunaratne,4.0,0,36,1,9.00,7,3,1,Sri Lanka
4,Wanindu Hasaranga de Silva,4.0,0,27,1,6.75,8,1,1,Sri Lanka

In [35]:
df1.shape

(500, 10)

In [36]:
df1.isnull().sum()

Bowler     0
Overs      0
Maiden     0
Runs       0
Wickets    0
Economy    0
0s         0
4s         0
6s         0
Country    0
dtype: int64

In [37]:
df1.to_csv('new_bowler_summary.csv',index=False)